{
    "thread": {
        "uuid": "34e19457d15f5355cb757396c29102987f17f205",
        "url": "https://www.bozemandailychronicle.com/longform/postpartum-depression-postpartum-support-bozeman-maternal-mental-health-care/article_715aaf48-0c19-4ad4-81e9-94f700d4513b.html",
        "site_full": "www.bozemandailychronicle.com",
        "site": "bozemandailychronicle.com",
        "site_section": "https://breastfeeding.einnews.com/rss",
        "site_categories": [
            "media"
        ],
        "section_title": "Breastfeeding News",
        "site_title": "Bozeman Daily Chronicle | Empowering the community",
        "title": "Bozeman Expands Support for New Mothers | Longform | bozemandailychronicle.com",
        "title_full": "Bozeman Expands Support for New Mothers | Longform | bozemandailychronicle.com",
        "published": "2025-04-24T00:15:00.000+03:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "https://bloximages.chicago2.vip.townnews.com/bozemandailychronicle.com/content/tncms/assets/v3/editorial/2/fe/2fe97c21-0708-4e1b-af71-ff510509c588/67ffebf7d51e1.image.jpg?crop=1764%2C926%2C0%2C124&amp;resize=1200%2C630&amp;order=crop%2Cresize",
        "performance_score": 0,
        "domain_rank": 17722,
        "domain_rank_updated": "2025-04-22T00:00:00.000+03:00",
        "licensing_agency": [],
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "34e19457d15f5355cb757396c29102987f17f205",
    "url": "https://www.bozemandailychronicle.com/longform/postpartum-depression-postpartum-support-bozeman-maternal-mental-health-care/article_715aaf48-0c19-4ad4-81e9-94f700d4513b.html",
    "ord_in_thread": 0,
    "author": "Lilly Keller",
    "published": "2025-04-24T00:15:00.000+03:00",
    "title": "Bozeman Expands Support for New Mothers | Longform | bozemandailychronicle.com",
    "text": "Before the birth of her daughter, Stephanie Bulluss was no stranger to depression and anxiety. A year earlier, she had lost her father suddenly to brain cancer and sought therapy to help her develop healthy coping mechanisms and begin processing her grief.\nAfter months of therapy, Bulluss felt like she was finally back on solid ground. When she became pregnant, she had in-depth conversations with her therapist about how pregnancy might affect her mental health, preparing herself for the possibility that her past struggles could resurface.\n“We talked a lot about what after pregnancy would look like and talking about postpartum and the possibility of that. So, I had all the resources, and even then, it was hard to utilize them,” Bulluss said.\nDespite this, nothing could fully prepare her for the isolation and anxiety that set in soon after giving birth.\nBulluss is one of tens of thousands of women nationwide who experience postpartum depression — a mood disorder marked by intense feelings of sadness, anxiety and irritability that can stretch far beyond the early weeks of motherhood. While many assume postpartum depression shows up right after birth, research reveals it can persist or even appear months later, according to the Mayo Clinic .\nAccording to the Centers for Disease Control and Prevention , one in eight women report experiencing symptoms of the mood disorders such as depression or anxiety. At nine to 10 months postpartum, 7.2% of women still report depressive symptoms — many of whom had no prior signs in the first few months. More than half (57.4%) of those experiencing later-onset depression had not reported symptoms at two to six months postpartum.\nBeyond postpartum depression, other perinatal mental health conditions can arise, including postpartum psychosis — a rare but severe disorder that typically develops within the first week after delivery. Characterized by confusion, obsessive thoughts about the baby, hallucinations and delusions, postpartum psychosis requires urgent medical attention, according to the Cleveland Clinic .\nDespite the prevalence of postpartum mental health struggles, many women continue to face barriers to care. Factors like stigma, lack of education, geographic isolation and financial constraints often prevent mothers from accessing the support they need, according to an article in Frontiers in Global Women's Health .\nTo bridge these gaps, maternal health providers in Bozeman are expanding access to perinatal mental health care through a combination of medical programs and community-driven initiatives. Their goal is to ensure that all women — regardless of social, economic or racial background — have the support they need before, during and after pregnancy.\nThis effort includes a range of services from Bozeman Health’s integrated care team—featuring nurse navigators, resource coordinators and psychiatrists specializing in maternal care — to more holistic options like Tree of Life Doula Care, which provides comprehensive pregnancy support, mental health resources and 24/7 crisis intervention.\nStill, for many women like Bulluss, having access to these resources doesn’t always make it easier to reach out for help. Stigma, self-doubt and the overwhelming demands of new motherhood can make it difficult to recognize the need for support—let alone ask for it.\nWhat is postpartum depression? Postpartum depression, also known as perinatal mood disorder, can affect women of all backgrounds, regardless of social, financial status, race or mental health history, according to Kathryn Bowen, founder and director of Bozeman Counseling Center.\nThough often misunderstood, postpartum depression is far from a modern phenomenon. Accounts of maternal mood disorders date back centuries, including writings by Ancient Greek physician Soranus of Ephesus, who documented women experiencing mood swings, intense emotions and even thoughts of harming their children after childbirth, according to National Geographic .\nWhile there is no single cause for postpartum depression, a combination of factors — including family history, hormonal changes, physical stress and emotional struggles like sleep deprivation, anxiety over the new baby and loss of self-esteem—are believed to contribute to the condition, according to the Mayo Clinic .\nDespite its prevalence, postpartum depression remains difficult for many women to talk about. Bowen said societal expectations that motherhood should be a time of pure joy can lead to feelings of shame for those who struggle. This stigma can prevent women from seeking help, even when they need it most.\nMedia portrayals of the condition often reinforce this misconception, she said, focusing primarily on extreme cases rather than the broader reality of postpartum mental health struggles.\nOne such high-profile case made national headlines earlier this year: In Byron, Wyoming, a mother fatally shot her four children before taking her own life. The tragedy was reported with headlines such as “Family gives heartbreaking update on sole survivor of Wyoming mom’s murder-suicide rampage that left 3 sisters dead,” in the New York Post and “Heartbroken dad breaks his silence after daughter, 7, died in hospital three days after her traumatized mom shot dead her three sisters then herself in murder-suicide,” in the Daily Mail . According to KTVQ , family and friends said she had been suffering from postpartum depression before the murder-suicide.\n“I’ve actually had new mothers that are fearful, like ‘Oh my gosh could that happen to me',” Bowen said. “But I do think that it can also be so far removed for people that they then can discount their own preventative care because they’re like that’ll never happen; it’s just too extreme.”\nIncidents like that in Byron are uncommon and are typically associated with postpartum psychosis, a rare but serious condition that affects 1 or 2 out of every 1,000 deliveries, according to Postpartum Support International .\nEven though these cases represent the most severe end of the spectrum, Bowen said that they highlight the importance of increased awareness and more open conversations around postpartum mental health — particularly to help reduce fear, stigma and isolation for those experiencing less extreme yet still serious symptoms.\n“There’s a misconception around, ‘Oh, I can handle it.’ The truth is you don’t know until you’re in it,” she said. “Another misconception is that it’s reserved for those who already have mental health issues. Postpartum depression can happen to anyone.”\nThis issue is far from distant in southwest Montana. In 2016 , a Bozeman woman took the lives of her husband and infant before ending her own. Similarly, in 1965, a woman in Livingston took the lives of her three sons before taking her own, according to newspaper archives .\nTo combat postpartum depression and even the rare cases of postpartum psychosis, Bowen emphasizes the importance of proactive measures, starting with conversations about postpartum mental health with primary care providers and OB-GYNs. This can help women get connected to a licensed therapist who specializes in postpartum care.\n“It's going to be different than going to a family member or friend or a pastor; those are great resources, but mental health therapists have the training and the experience to help in a different way,” she said. “It doesn't have to be long-term; I know time and money can be tough. But getting in for a few sessions can go a long way.”\nAsking for help Still, even with the knowledge that seeking help is an essential step toward wellness, it doesn’t necessarily make the process easier, especially for new mothers like Bulluss. Having experienced therapy, she knew returning would be key to regaining control over her life, but the emotional weight still felt overwhelming.\nA week after giving birth, Bulluss’ husband returned to his construction job, leaving early and coming home late, exhausted and unable to fully alleviate her worries and exhaustion. Alone for long stretches, she found herself consumed by anxiety over her baby’s well-being, unable to escape the mounting fears that gripped her each day.\n“That first night before he left for work, the first day, I remember just bawling because I was like, 'You're leaving me alone with this tiny human?' I have no idea what I'm doing and that was really, really scary for me,” she said.\nWhile it’s common for new mothers to experience a surge of emotions like sadness or a sense of not feeling like themselves following childbirth — a phenomenon known as the \"baby blues,\" which affects four in five new parents (80%) due to hormonal changes, according to the March of Dimes — these feelings typically subside within a few days to two weeks.\nFor Bulluss, however, they didn’t fade. They deepened.\nAs the days stretched into months, Bulluss felt trapped in survival mode. Exhausted to the point of physical pain, she found herself quietly breaking down in the shower, the only place she could let her emotions spill out.\n“You really, truly go into kind of survival mode. I remember being like, I didn't know being exhausted could be painful,” she said.\nBut the exhaustion wasn’t just physical. The relentless expectations she placed on herself weighed heavily. Struggles with breastfeeding, the never-ending cycle of pumping and cleaning equipment, waking her baby for scheduled feedings and trying to balance her own needs with allowing her husband to rest all left her stretched impossibly thin.\n“That was so tough, I can’t even explain,” Bulluss said. “One of the hugest things that I think we don't really realize as parents is just that grief process you have to go through of your life prior to your baby, your life will never be the same, you're never going to just be able to get up and go.”\nAs the reality of motherhood set in, so did a suffocating sense of confinement. Before becoming a mother, Bulluss had been fiercely independent. But now, just a few months after her daughter’s birth, she felt the walls closing in. That was when the intrusive thoughts began.\n“Those intrusive thoughts would be like, what if I dropped this knife and it fell on her and hurt her? What if I accidentally just threw her across the room? It's stuff I would absolutely never do. I would never hurt my baby. I didn't want to hurt my baby, but they will pop into my brain and really freak me out and be really distressing,” she said.\nSleep offered little relief. For the first three months of her daughter’s life, Bulluss was plagued by a recurring nightmare. Despite never letting her baby sleep in bed with her, she dreamt that she would wake to find her daughter missing — until, burrowing through the sheets, she'd discover her fragile form, suffocated beneath the blankets.\n“I would wake up in a cold sweat, freaking out in the middle of the night and then scrambled to her bassinet to find her,” she said.\nYet even as exhaustion and anxiety consumed her, Bulluss told herself she was managing.\nThen, around her daughter’s first birthday, she read an article about a father and son who drowned while seeking asylum in the U.S., chased into the river by the Border Patrol. The image of that loss — of a child slipping away — hit her with an intensity she hadn’t previously felt. That was when she realized she was slipping over the edge.\n“I read that and it broke me,” Bulluss said. “I just kept thinking how I would feel in that situation. I would do anything to save my baby. I would do anything to take care of her and the idea that you can do anything and everything to try and keep your kid safe and the worst can still happen.”\nIn the days that followed, she spiraled, crying in bed, unable to function. Eventually, she realized she couldn’t keep suffering in silence.\n“I was like, this is a problem. You read a news story and you can’t get out of bed today,” she said. “That was kind of a moment for me, like 'OK, I think we’ve tipped over the point of no return'.”\nExpanding access to support Although barriers exist to accessing care for postpartum depression, such as transportation and extreme weather in more rural areas, child care and finances, women’s health care providers like Bozeman Health have been working to bridge those gaps so all women are able to access quality care, said Brooke Cadwell, a certified nurse midwife and a psychiatric mental health nurse practitioner with Bozeman Health.\n“Moms are the axis our world spins around. So when moms are not on point and they're not doing well, no one in the world is doing well,” Cadwell said. “One of the things that Bozeman Health specifically has done right is really understood that maternal health is literally the foundation for everything moving forward for the rest of people's lives.”\nThe health care network uses an integrated care model, a team-based approach in which health care providers from multiple disciplines coordinate with patients and families throughout pregnancy and postpartum.\nCadwell said this includes services such as nurse navigators who guide patients through the health care system, behavioral health groups and resource coordinators who help connect patients to financial assistance and public programs like Medicaid. The goal, she said, is to make sure each patient’s needs are addressed through consistent communication among care teams.\n“We all work in a collaborative care model. We communicate if one of the providers says, I’m really worried and concerned about this mom; I’m going to do a warm handoff to one of our behavior health specialists,” Cadwell said. “Our OBGYNs don’t necessarily have the time to sit and do a full hour appointment, but other members of our team do.”\nIn addition to this team-based approach, Cadwell said Bozeman Health’s network of hospitals and clinics also gives patients choices in how their care is delivered. For example, some may opt for a holistic nursing approach — often provided by nurse midwives — that emphasizes mental well-being and social support, while others may choose a more traditional medical model centered on symptom assessment and diagnosis based on patient history.\n“I think, especially in the United States, the reason we see such satisfaction with nurse midwives is that it’s a different relationship and a different approach to care that really focuses on the big picture, not pieces of the picture,” she said.\nThat broader perspective, Cadwell said, reflects Bozeman Health’s commitment to viewing women’s health as the foundation for overall well-being. By recognizing the central role of maternal health, she said, the system is not only able to meet the needs of new mothers but to help entire families thrive.\n“If we can start mom off well, then those kids are going to get a good start. And that's that trajectory is going to continue through their lifetime, right? So the best thing that we can do in general for health of the nation is ensuring that the health of mothers is really and women, just in general, is really valued as a top priority,” she said.\nFor Cadwell, who has worked at Bozeman Health for over a decade, focusing her career on ensuring women’s mental health is prioritized throughout pregnancy came naturally. Throughout her schooling, she frequently encountered the issue of maternal mental health struggles, which reinforced her commitment to supporting women at every stage of their pregnancy.\n“I had one day where I had a woman who was on Medicaid and I called 17 different psychiatric providers and they either didn’t accept Medicaid or weren’t taking new patients,” she said. “I just realized that I’m never going to do this ever again. I'm never going to spend my time trying to get someone the help they need. I'm just going to do it myself.”\nWhile Cadwell said Bozeman Health has made significant strides over the past decade to improve access to perinatal mental health care, she acknowledged work remains, particularly in addressing accessibility challenges in rural communities.\n“A lot of the times, people will just opt to not come in because there’s too many transportation barriers or if you have other kids, then who watches them? What happens if you live on a ranch and someone has to stay home and care for the animals?” Cadwell said. “I also think there’s a lot of mistrust for health-care providers so because of that, a lot of the information that a family might get from coming to seek out care in the hospital, for example, they might not be getting because there might not be that knowledge from where they're getting their care.”\nMeeting families where they are Recognizing those barriers, local public health agencies have stepped in to help fill the gaps. The Gallatin City-County Health Department, for instance, offers a range of family support services aimed at meeting parents where they are — both physically and emotionally, said Amie Gatterdam, the department's women, infants and children program director.\nOne of the department’s cornerstone programs is the Healthy Gallatin Home Visiting Program, which sends nurses and other specialists directly into families’ homes to provide education, guidance and emotional support. Services begin during pregnancy and can continue through the child’s fifth birthday.\nThe reasons families are referred to the program vary widely, Gatterdam said, ranging from a lack of nearby family support to more acute challenges, such as signs of postpartum mental health concerns. But no matter the situation, the goal remains the same: to ensure every family in Gallatin County has access to the care and resources they need to thrive.\n“It really runs the gamut of why someone would be referred to us, all the way from being new to the community and not having a lot of family support to, working with Child Protective Services, to mental health needs to a baby that was born with special care needs, having trouble with lactation and having breastfeeding issues to domestic violence in the home,” she said.\nLaunched more than 30 years ago, the program now receives between 800 and 900 referrals each year. It’s staffed by 13 home visitors, including registered nurses, social workers, lactation counselors, and father engagement specialists who support families with children from the prenatal stage through age 5.\nThe program is built on an evidence-based model called Parents as Teachers, which emphasizes each family’s individual goals, such as child development, parenting education and instilling parents with confidence and independence while also offering routine screenings, mental health check-ins and connections to community resources. Gatterdam said this approach creates space for parents — especially mothers — to share how they’re really feeling during what can be an overwhelming and isolating time.\n“They’re (the home visiting staff) doing the screening with them, they’re having the conversation, ‘I see some concerns here, would you be willing for me to call your OB?’ or ‘You checked here that you’re having thoughts of harming yourself — this is what I think we should do. I want your voice in this and together we can come up with a safety plan',” Gatterdam said\nThe health department also partners closely with Bozeman Health, which “universally refers” all first-time moms to the program. Particular attention is given to those who smoke, score a 13 or higher on the Edinburgh Postnatal Depression Scale — a tool designed to screen for symptoms of postpartum depression — or are navigating early parenthood as teenagers, according to Gatterdam.\nBeyond regular home visits, families involved in the program also have access to resources from partner organizations such as Roots Family Collaborative, which works with local mental health providers specializing in trauma, postpartum support, couples counseling and burnout in motherhood, according to Gatterdam.\n“We make sure, whether it’s calling that therapist together to make the initial appointment or sometimes even going to that first appointment with them, to having that hard conversation with their spouse, to make sure, if they feel embarrassed or they're hesitant, then having that conversation together,” she said.\nDespite the progress the family visit program has made over the years in reaching more families and addressing a wide range of needs, Gatterdam said that challenges persist, particularly stigma, funding and the ongoing effort to raise awareness about the program’s availability.\n“I used to be the person who would go in and meet with every new mom, and they would literally be like, ‘Why did you come? Why did I get picked?' ” she said. “My dream has always been this universal model where it’s just part of having a baby. In Europe when they’re discharging you from the hospital the pediatrician says so did you get your home visit scheduled?”\nThat vision is starting to take shape. In January, the Health Department launched its Universally Offered Home Visiting program, which offers home visits to all families from 34 weeks pregnant up to a year postpartum regardless of income.\n“Our hope is that there will be no stigma because in our community, everybody who has a baby can get up to four free home visits,” she said.\nTree of Life Doulas This push for more universal support is part of a broader effort in Gallatin County to improve postpartum care. Although mental health services for new parents have been available locally for over 30 years, the 2016 murder-suicide in Bozeman — linked to severe postpartum depression — prompted renewed attention to the importance of accessible and proactive care, influencing residents like Kelli Stanley, founder of Tree of Life Doula Care.\nSince its launch in 2013, Tree of Life Doula Care has worked to fill those gaps, offering professional, compassionate support through doulas, direct mental health services and access to additional parenting and family resources. According to Stanley, the organization’s efforts are rooted in the hope of preventing future tragedies and ensuring that families have the support they need from the start.\n“When I started doing this work, I wanted to ensure that we had postpartum care always,” Stanley said. “There are doulas who only support families during labor and birth; they'll support them prenatally with some education and then are there for the birth. But it was always really important to me to have this postpartum piece accompanying it too, because so much can happen in the first couple of weeks after birth.”\nTree of Life is made up of certified doulas — trained, nonmedical professionals who offer emotional, educational and physical support through a variety of experiences, including childbirth, miscarriage and stillbirth. Stanley said the organization takes a holistic approach, helping families prepare for birth while also focusing on how postpartum care is understood and addressed by individuals and the broader community.\n“A lot of people feel like ‘Oh, I'm going to have this lovely baby and it's gonna be fine. We're just going to be this family. But there are so many components to it,” she said. “Then there’s a new little person who doesn’t follow the book you’ve read and then if there are these other insecurities or feeling overwhelmed it can be challenging.\"\nRecognizing that postpartum can last up to two years, Stanley knew the care center needed services to support women beyond pregnancy and birth. These include emotional check-ins, nonjudgmental listening, infant care education, referrals to mental health services, hands-on support, overnight care for better sleep and a perinatal mental health crisis line available at any time.\nWhat sets Tree of Life apart from other perinatal care providers, Stanley said, is their ability to address issues with new mothers quickly and flexibly — often in the comfort of the family’s home, eliminating the stress of travel and child care.\n“We can go into their homes and we can work through a newborn care plan,\" she said. \"We can work through feeding and sleeping. We can talk with them about how things are set up in their home. We can talk with partners and whatever support system they already have, and come up with a game plan. It's very attainable.”\nRegardless of when a mother begins working with the doulas — whether in the first trimester or later — Tree of Life’s goal is to wholeheartedly support women throughout their entire pregnancy journey and work with them to make the experience what they want it to be rather than directing them down a singular route for what the journey will look like, according to Stanley.\n“We walk with them through the experience,” she said. “We’re also what I would call like a lifeline in pregnancy and in postpartum, where somebody can call or text or reach out to us with a question or a concern or a thought that comes up. We’re with them for however long they need.”\nWith a collective of doulas, Tree of Life can match families with specialists in areas like sibling support and family adjustment. According to Mikaela DiBerardinis, a certified doula and community coordinator, this ensures personalized care and extra support for families.\nDrawing from years of experience, DiBerardinis said the doulas can quickly identify when a family needs additional support.\nIn crisis situations, Tree of Life provides immediate, in-person help and accompanies families through the next steps, whether that means heading to the emergency room, contacting a provider or therapist or helping de-escalate the situation.\n“I’ve heard, even just recently with someone texting me, ‘I don’t know how I would have gotten through last night if I wasn’t able to call you,’” DiBerardinis said. “Having somebody that you can talk to, somebody that you can just throw a question, a thought, and have it be judgment-free. We've heard all the things, the things that we don't really want to talk about that are pretty dark and scary and we don't sit there and judge this person. We say this person really needs help, and I need to help them now.”\nHowever, not every parent in need has someone like that to call.\nLooking Ahead Even in Bozeman, where a growing network of doulas, therapists, and mental health advocates is working to support new families, barriers remain when it comes to accessing care.\nThese challenges, said Bowen, founder and director of Bozeman Counseling Center, range from the lack of insurance, which makes it difficult for uninsured Montanans to access services, to language barriers for non-English speaking residents. There is also a shortage of pregnancy care centers and resources for individuals living in surrounding rural communities such as West Yellowstone and Gardiner.\n“Bozeman Health is doing a great job trying to fill the gaps,” Bowen said. “If someone doesn't have health insurance, it can be really expensive to go find a therapist. If you don't have insurance, there's not as many resources for those that need a sliding fee.”\nMontana’s Chapter of Postpartum Support International is also working toward making doula care more accessible in both rural and populated communities, especially among non-English speaking populations and on reservations.\n“Having a doula is a big deal and the knowledge of how medication can help or not help certain situations, so that navigation in general is very difficult. So that makes it a million times worse when you don't have the language, said Adriana Reyes de Merkle, chair of Montana’s Postpartum Support International chapter. “We need more providers who are able to speak Spanish. We need the education to be in Spanish. It's already hard navigating as it is in our own language, and so it makes it a million times more difficult when we can't even express ourselves in our native language.”\nFor families in rural areas, these gaps are made even wider by logistical barriers like transportation and weather, which make it harder for them to reach Bozeman’s perinatal resources. Cadwell, a certified midwife and psychiatric mental health nurse practitioner with Bozeman Health, has witnessed how these obstacles impact women and families in places like Three Forks, who often miss appointments due to these challenges.\nBeyond access issues, the stigma surrounding mental health remains a significant barrier, according to Cadwell.\n“Every woman is at risk for mood disruption in pregnancy or postpartum. Of course, you're at a little higher risk if you have a history of any mood concerns, but every single woman with every single pregnancy has a new set of risk factors,” she said.\nIn a state where the individualistic “pull yourself up by your bootstraps” mentality often prevails — and with Montana having the highest suicide rate in the country, according to the CDC — Cadwell emphasized that addressing mental health issues requires more than just adequate resources. It also calls for a shift in how mental health is talked about, both during and outside of pregnancy.\n“I find that putting an emphasis on it being about our brain and the health of our brain, and really not being in control, like we can't change our genetics, but we can support them and we can understand why our genetics are making us more, at risk for certain things,” Cadwell said.\nBreaking the silence For some, that support means being a steady presence during a moment of crisis — someone to call when everything feels overwhelming. For others, like Bulluss, the mother who battled postpartum depression for over a year after her daughter’s birth, healing began with a different kind of strength: Learning to speak up for what she needed.\nShe began by making an appointment with her primary care doctor, restarting antidepressants and reconnecting with her therapist. Bit by bit, Bulluss found her footing again, finally feeling the first rays of sun after what felt like an endless winter.\n“I had waited until I was probably right at the precipice of this is about to be an emergency,” Bulluss said. “I think the biggest part was acknowledging, I'm struggling. I did a really good job of talking myself out of it. I kept being like, no, there's nothing to be sad about. There's nothing to be anxious about. You have been through the worst thing that's ever happened to you, and this is the best thing that's ever happened to you. Why are you sad? Why are you struggling?”\nHaving a space where she could finally open up allowed Bulluss not only to be present in her day-to-day life but also to extend compassion to her past self for waiting so long to ask for help. With child care finally in place and someone to watch her daughter during sessions, she could prioritize her healing in a way that hadn’t been possible.\nTherapy also opened the door to conversations she hadn’t known she needed. As she began to speak more openly with friends and family, Bulluss discovered she wasn’t alone. Some of her closest friends, even her own mother, had experienced postpartum struggles too.\n“Now we talk about how we all kind of dealt with postpartum, but neither of them had talked about it either,” she said.\nThat realization — that so many others also suffered in silence — sparked something deeper. After a year in therapy and finally settling into the rhythm of parenting, Bulluss felt a pull to do more. She enrolled in classes at Montana State University and began working toward her master’s degree in Marriage and Family Counseling, hoping to support others the way she had finally been supported herself.\n“I had all the things in place. I had the support in place. I had a counselor beforehand; I had knowledge of mental health. I had that self-awareness. I had people in my life I could talk to if I wanted to. And I still feel like our system is set up to fail,” she said. “What I would tell other people about it is that, yes, there's hormonal shifts, there's things that happen that we know contribute to postpartum, like having other mental health struggles prior, but the hugest part of it is just that support. You have no idea how exhausting or isolating or hard it's going to be until you're in it and you realize you're kind of in it alone.”\nNow a therapist at Bozeman Counseling Center, where she specializes in parent coaching, relationships and postpartum depression, Bulluss finds herself across from new parents who are living through what she once did, helping walk them back from the edge and letting them know they’re not alone.\n“Just being able to sit across from another mom and be like, I know this is really hard, I know that you're so deprived and you're isolated. You're not alone, and it's OK.. There doesn't have to be shame that you're sitting in this room feeling like, 'why is this so hard?' Because really, you're doing something so great for your family in the future because you're getting this help for yourself now.”\nLet the news come to you Get any of our free daily email newsletters — news headlines, opinion, e-edition, obituaries and more.\nExplore newsletters Lilly Keller can be reached at lkeller@dailychronicle.com .\n(0 Ratings)",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Health"
    ],
    "topics": [
        "Health->health treatment and procedure",
        "Health->mental health and disorder"
    ],
    "ai_allow": false,
    "has_canonical": false,
    "breaking": false,
    "webz_reporter": false,
    "external_links": [
        "https://www.mayoclinic.org/diseases-conditions/postpartum-depression/symptoms-causes/syc-20376617",
        "https://www.cdc.gov/reproductive-health/depression/index.html#:~:text=Depression%20rates%20during%20and%20after%20pregnancy&text=CDC%20research%20shows%20about%201,reported%20symptoms%20of%20postpartum%20depression.",
        "https://www.ktvq.com/neighborhood-news/northern-wyoming/toxicology-report-show-ketamine-in-wyoming-moms-system-before-murder-suicide",
        "https://www.nationalgeographic.com/premium/article/postpartum-depression-history-childbirth-complication",
        "https://postpartum.net/perinatal-mental-health/",
        "https://www.dailymail.co.uk/news/article-14405313/heartbroken-dad-breaks-silence-daughter-died-mother-murder-suicide.html",
        "https://pmc.ncbi.nlm.nih.gov/articles/PMC11157017/#:~:text=Researchers%20have%20documented%20that%20women,16%2C%2046%2C%2047",
        "https://www.greatfallstribune.com/story/news/local/2016/03/11/sheriff-people-found-dead-home-east-bozeman/81681792/",
        "https://www.newspapers.com/article/the-billings-gazette-livingston-homicide/165401976/",
        "https://my.clevelandclinic.org/health/diseases/24152-postpartum-psychosis",
        "https://nypost.com/2025/02/16/us-news/family-gives-update-on-survivor-of-wyoming-mom-murder-suicide/",
        "https://www.marchofdimes.org/find-support/topics/postpartum/baby-blues-after-pregnancy",
        "https://ktvq.com/neighborhood-news/northern-wyoming/toxicology-report-show-ketamine-in-wyoming-moms-system-before-murder-suicide",
        "https://mayoclinic.org/diseases-conditions/postpartum-depression/symptoms-causes/syc-20376617",
        "https://marchofdimes.org/find-support/topics/postpartum/baby-blues-after-pregnancy",
        "https://newspapers.com/article/the-billings-gazette-livingston-homicide/165401976/",
        "https://nypost.com/2025/02/16/us-news/family-gives-update-on-survivor-of-wyoming-mom-murder-suicide",
        "https://www.greatfallstribune.com/story/news/local/2016/03/11/sheriff-people-found-dead-home-east-bozeman/81681792",
        "https://nationalgeographic.com/premium/article/postpartum-depression-history-childbirth-complication",
        "https://cdc.gov/reproductive-health/depression/index.html#:~:text=Depression%20rates%20during%20and%20after%20pregnancy&text=CDC%20research%20shows%20about%201,reported%20symptoms%20of%20postpartum%20depression.",
        "https://www.nypost.com/2025/02/16/us-news/family-gives-update-on-survivor-of-wyoming-mom-murder-suicide/",
        "https://www.pmc.ncbi.nlm.nih.gov/articles/PMC11157017/#:~:text=Researchers%20have%20documented%20that%20women,16%2C%2046%2C%2047",
        "https://www.postpartum.net/perinatal-mental-health/",
        "https://postpartum.net/perinatal-mental-health",
        "https://dailymail.co.uk/news/article-14405313/heartbroken-dad-breaks-silence-daughter-died-mother-murder-suicide.html",
        "https://www.my.clevelandclinic.org/health/diseases/24152-postpartum-psychosis",
        "https://www.newspapers.com/article/the-billings-gazette-livingston-homicide/165401976",
        "https://greatfallstribune.com/story/news/local/2016/03/11/sheriff-people-found-dead-home-east-bozeman/81681792/"
    ],
    "entities": {
        "persons": [
            {
                "name": "Stephanie Bulluss",
                "sentiment": "negative"
            }
        ],
        "locations": [],
        "organizations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": "34e19457d15f5355cb757396c29102987f17f205",
        "first_syndicated": true
    },
    "trust": {
        "categories": [],
        "bias": "center",
        "source": {
            "type": null,
            "city": null,
            "state": null,
            "country": null,
            "domain_type": null,
            "agency": null,
            "organization_name": null
        }
    },
    "rating": null,
    "crawled": "2025-04-24T00:34:56.741+03:00",
    "updated": "2025-05-03T00:26:58.633+03:00"
}